@bryantbiggs, I retested this and I was slightly inaccurate in my response about this problem. The SG is replaced by the module, however, if my EC2 instances are managed by this TF the SG is removed and the new SG is added to to the instances. If, however, my EC2 instances are not managed by this TF, the change will fail because the SG cannot be removed. The following is an example, including the version numbers you requested:

Versions:

```text
> terraform init
Initializing modules...
Downloading terraform-aws-modules/security-group/aws 3.4.0 for on-prem-workload-sg...
- on-prem-workload-sg in .terraform/modules/on-prem-workload-sg
Downloading terraform-aws-modules/vpc/aws 2.30.0 for vpc...
- vpc in .terraform/modules/vpc

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "null" (hashicorp/null) 2.1.2...
- Downloading plugin for provider "template" (hashicorp/template) 2.1.2...
- Downloading plugin for provider "random" (hashicorp/random) 2.2.1...
- Downloading plugin for provider "vault" (hashicorp/vault) 2.9.0...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.54.0...

> terraform --version
Terraform v0.12.16
+ provider.aws v2.54.0
+ provider.null v2.1.2
+ provider.random v2.2.1
+ provider.template v2.1.2
+ provider.vault v2.9.0
```

Plan output for the EC2 instance changes:

```text
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.aws-linux-1 will be updated in-place
  ~ resource "aws_instance" "aws-linux-1" {
.
.
.
      ~ vpc_security_group_ids       = [
          - "sg-0f12bcf70c42d4e5a",
        ] -> (known after apply)

        credit_specification {
            cpu_credits = "standard"
        }
```

Plan output for the SG changes:

```text
-/+ resource "aws_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:<redacted>:<redacted>:security-group/sg-<redacted>" -> (known after apply)
      ~ description            = "Security group to allow access to workload instances" -> "I changed this" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "All protocols"
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-<redacted>" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
  
.
.
.

  # module.on-prem-workload-sg.aws_security_group_rule.egress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "egress_rules" {
        cidr_blocks              = [
            "0.0.0.0/0",
        ]
        description              = "All protocols"
      ~ from_port                = 0 -> -1
      ~ id                       = "sgrule-<redacted>" -> (known after apply)
        ipv6_cidr_blocks         = [
            "::/0",
        ]
        prefix_list_ids          = []
        protocol                 = "-1"
      ~ security_group_id        = "sg-<redacted>" -> (known after apply) # forces replacement
        self                     = false
      + source_security_group_id = (known after apply)
      ~ to_port                  = 0 -> -1
        type                     = "egress"
    }
.
.
.
```

Several other rules are replaced because the SG is replaced but I won't repeat those here. 